#Область ПрограммныйИнтерфейс

Процедура Дополнитьформу(форма) Экспорт
	// Процедура добавляет дополнительные элементы на форму в зависимости от её типа
	Имяформы = Форма.Имяформы;
	Если Имяформы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
		ДобавитьПолеСогласованнаяСкидкаВГруппаШапкаПраво(форма);
		ДобавитьКнопкуВГруппаШапкаПраво(форма);
	ИначеЕсли Имяформы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли Имяформы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли Имяформы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоНаформуПередОснование(Форма);
	ИначеЕсли Имяформы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоНаформуПередСуммаДокумента(Форма);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(форма)
	// {{ Шилов Н. А: Добавлено поле "Контактное лицо" в группу "ШапкаПраво"
	ПолеВвода = Форма.Элементы.Добавить ("КонтактныеЛица", Тип("Полеформы"), Форма.Элементы.ГруппаШапкаПраво);
	ПолеВвода.Вид = ВидПоляформы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.Н_КонтактноеЛицо";
	// }}
КонецПроцедуры

Процедура ВставитьПолеКонтактноеЛицоНаформуПередСуммаДокумента(Форма)
	// {{ Шилов Н. А: Вставлено поле "Контактное лицо" перед полем "СуммаДокумента"
	ПолеВвода = Форма.Элементы.Вставить ("КонтактныеЛица", Тип("Полеформы"), , Форма.Элементы.СуммаДокумента);
	ПолеВвода.Вид = ВидПоляформы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.Н_КонтактноеЛицо";
	// }}
КонецПроцедуры


Процедура ВставитьПолеКонтактноеЛицоНаформуПередОснование(Форма)
	// {{ Шилов Н. А: Вставлено поле "Контактное лицо" перед полем "Основание"
	ПолеВвода = Форма.Элементы.Вставить ("КонтактныеЛица", Тип("Полеформы"), , Форма.Элементы.Основание);
	ПолеВвода.Вид = ВидПоляформы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.Н_КонтактноеЛицо";
	// }}
КонецПроцедуры

Процедура ДобавитьПолеСогласованнаяСкидкаВГруппаШапкаПраво(форма)
	// {{ Шилов Н. А: Добавлено поле "Согласованная скидка" в группу "ШапкаПраво"
	ПолеВвода = Форма.Элементы.Добавить ("СогласованнаяСкидка", Тип("Полеформы"), Форма.Элементы.ГруппаШапкаПраво);
	ПолеВвода.Вид = ВидПоляформы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.Н_СогласованнаяСкидка";
	ПолеВвода.УстановитьДействие("ПриИзменении", "Н_СогласованнаяСкидкаПриИзменении"); 
	// }}
КонецПроцедуры

Процедура ДобавитьКнопкуВГруппаШапкаПраво(форма)
	// {{ Шилов Н. А: Добавлена кнопка "Пересчитать суммы" в группу "ШапкаПраво"
	Команда = Форма.Команды.Добавить("Н_ПересчитатьСуммы");
	Команда.Действие = "Н_ПересчитатьСуммыПосле";
	Команда.Заголовок = "Пересчитать суммы";
	Кнопка = Форма.Элементы.Добавить("Н_ПересчитатьСуммы", Тип("КнопкаФормы"), Форма.Элементы.ГруппаШапкаПраво);
	Кнопка.ИмяКоманды = "Н_ПересчитатьСуммы";
	Кнопка.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	// }}
КонецПроцедуры


#КонецОбласти